In [15]:
import pandas as pd

In [16]:
dict1 = {'Name':['Priyang', 'Aadhya', 'Krisha', 'Vedant', 'parsh',
                'Mittal', 'Archana'],
         'Marks':[98,89,99,87,90,83,99],
         'Gender':['Male', 'Female', 'Female', 'Male', 'Male',
                   'Female', 'Female']
         }
df=pd.DataFrame(dict1)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4    parsh     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [17]:
# 1. top 3 rows
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [18]:
# 2. bottom 3 rows
df.tail(3)

      Name  Marks  Gender
4    parsh     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [19]:
# 3. Find shape of our Dataset(number of rows and number of column)
df.shape

(7, 3)

In [20]:
# 4. get infor about dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
Name      7 non-null object
Marks     7 non-null int64
Gender    7 non-null object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [21]:
# 5. check null values in the dataset:
df.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [22]:
# 6. Get overall statistics about the dataframe
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [23]:
# 7. Find unique values from the gender column
df.columns
df.Gender.unique()

array(['Male', 'Female'], dtype=object)

In [24]:
# 8. Find the Number of unique values from the gender column?
df.Gender.nunique()

2

In [25]:
# 9. Display count of Unique values in gender column
df.Gender.value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [26]:
# 10. Find Total number of students Having Marks between 90 to 100.
df.columns
len(df[(df['Marks']>=90) & (df['Marks']<=100)])

4

In [27]:
df.Marks.between(90,100).sum()

4

In [28]:
# 11. Find average marks
df.Marks.mean()

92.14285714285714

In [29]:
# 12. Apply method
def marks(x):
    return x/2

In [30]:
df.Marks.apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [33]:
df['Half_marks'] = df.Marks.apply(lambda x:x//2)
df

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4    parsh     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [35]:
# 13. Map function
df['nGender'] = df.Gender.map({'Male':1, 'Female':0})
df

      Name  Marks  Gender  Half_marks  nGender
0  Priyang     98    Male          49        1
1   Aadhya     89  Female          44        0
2   Krisha     99  Female          49        0
3   Vedant     87    Male          43        1
4    parsh     90    Male          45        1
5   Mittal     83  Female          41        0
6  Archana     99  Female          49        0

In [39]:
# 14. Delete the column
#df.drop(['Half_marks','nGender'], axis=1)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4    parsh     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [41]:
#15. Sort the dataframe as per the marks column
df.sort_values(by=['Marks','Gender'])

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4    parsh     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [44]:
# 16. display name and marks of the female students

df[df.Gender=='Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [46]:
df[df['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99